Ran Plan for 2 projects:

1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
1. project: `s3/zerone-id` dir: `terraform/s3/zerone-id` workspace: `default`

### 1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_policy.sumologic_s3_policy will be created
+ resource "aws_iam_policy" "sumologic_s3_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Sumo Logic to receive s3 bucket logs"
      + id               = (known after apply)
      + name             = "sumologic-s3-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucketVersions",
                          + "s3:ListBucket",
                          + "s3:GetObjectVersion",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::tmcdapne2-vpcflow-log/*",
                          + "arn:aws:s3:::tmcdapne2-vpcflow-log",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.sumologic_role will be created
+ resource "aws_iam_role" "sumologic_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "kr:0000000000000393"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::926226587429:root"
                        }
                      + Sid       = "AllowAssumeRoleForSumologic"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sumologic-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.sumologic_s3_attachment will be created
+ resource "aws_iam_role_policy_attachment" "sumologic_s3_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sumologic-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fiam%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/zerone-id`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `s3/zerone-id` dir: `terraform/s3/zerone-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.tmcdapne2_vpcflow_log will be created
+ resource "aws_s3_bucket" "tmcdapne2_vpcflow_log" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tmcdapne2-vpcflow-log"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.tmcdapne2_vpcflow_log_bucket_acl will be created
+ resource "aws_s3_bucket_acl" "tmcdapne2_vpcflow_log_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.tmcdapne2_vpcflow_log_ownership will be created
+ resource "aws_s3_bucket_ownership_controls" "tmcdapne2_vpcflow_log_ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_policy.tmcdapne2_vpcflow_log_bucket_policy will be created
+ resource "aws_s3_bucket_policy" "tmcdapne2_vpcflow_log_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:logs:ap-northeast-2:066346343248:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "066346343248"
                              + "s3:x-amz-acl"      = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::tmcdapne2-vpcflow-log/AWSLogs/066346343248/*"
                      + Sid       = "AWSLogDeliveryWrite"
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:logs:ap-northeast-2:066346343248:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "066346343248"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::tmcdapne2-vpcflow-log"
                      + Sid       = "AWSLogDeliveryAclCheck"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p s3/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fs3%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p s3/zerone-id`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
